src/DataProcessors/рдв_АРМИнтеграции/рдв_АРМИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>рдв_АРМИнтеграции</name>
</mdclass:DataProcessor>

src/InformationRegisters/рдв_СообщенияИнтеграции/рдв_СообщенияИнтеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>рдв_СообщенияИнтеграции</name>
  <resources>
    <name>ВидСообщения</name>
    <type>
      <types>CatalogRef.рдв_ВидыСообщенийИнтеграции</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РазмерСообщения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Направление</name>
    <type>
      <types>EnumRef.рдв_НаправленияСообщенийИнтеграции</types>
    </type>
  </resources>
  <attributes>
    <name>АдресМетода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.рдв_СтатусыОбработкиСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРегистрацииМс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>30</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСобытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаЗаписиНачалоЧаса</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.рдв_ВнешниеСистемы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/рдв_АРМИнтеграции/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Функция ОбновитьДанные(ПериодОбновления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	рдв_ВнешниеСистемы.Ссылка КАК ВнешняяСистема,
	|	1 КАК Состояние
	|ИЗ
	|	Справочник.рдв_ВнешниеСистемы КАК рдв_ВнешниеСистемы
	|ГДЕ
	|	НЕ рдв_ВнешниеСистемы.ПометкаУдаления
	|	И НЕ рдв_ВнешниеСистемы.Ссылка = &ЭтотУзел
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВнешняяСистема
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СообщенияИнтеграции.ВидСообщения КАК ВидСообщения,
	|	КОЛИЧЕСТВО(1) КАК Количество,
	|	СообщенияИнтеграции.СтатусОбработки,
	|	СообщенияИнтеграции.Направление КАК Направление
	|ИЗ
	|	РегистрСведений.рдв_СообщенияИнтеграции КАК СообщенияИнтеграции
	|ГДЕ
	|	СообщенияИнтеграции.Направление = ЗНАЧЕНИЕ(Перечисление.рдв_НаправленияСообщенийИнтеграции.Входящее)
	|	И СообщенияИнтеграции.ДатаРегистрацииМс >= &ДатаМс
	|СГРУППИРОВАТЬ ПО
	|	СообщенияИнтеграции.ВидСообщения,
	|	СообщенияИнтеграции.СтатусОбработки,
	|	СообщенияИнтеграции.Направление
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСообщения
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	СтатусОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(1) КАК Количество,
	|	рдв_РегистрацияИзменений.ВидСообщения КАК ВидСообщения
	|ИЗ
	|	РегистрСведений.рдв_РегистрацияИзменений КАК рдв_РегистрацияИзменений
	//|ГДЕ
	//|	рдв_РегистрацияИзменений.ДатаРегистрации >= &Дата
	|ГДЕ
	|	рдв_РегистрацияИзменений.ДатаРегистрацииВМиллисекундах >= &ДатаМс
	|СГРУППИРОВАТЬ ПО
	|	рдв_РегистрацияИзменений.ВидСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСообщения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СообщенияИнтеграции.ВидСообщения КАК ВидСообщения,
	|	КОЛИЧЕСТВО(1) КАК Количество,
	|	СообщенияИнтеграции.СтатусОбработки КАК СтатусОбработки,
	|	СообщенияИнтеграции.Направление КАК Направление
	|ИЗ
	|	РегистрСведений.рдв_СообщенияИнтеграции КАК СообщенияИнтеграции
	|ГДЕ
	|	СообщенияИнтеграции.Направление = ЗНАЧЕНИЕ(Перечисление.рдв_НаправленияСообщенийИнтеграции.Исходящее)
	|	И СообщенияИнтеграции.ДатаРегистрацииМс >= &ДатаМс
	|СГРУППИРОВАТЬ ПО
	|	СообщенияИнтеграции.ВидСообщения,
	|	СообщенияИнтеграции.СтатусОбработки,
	|	СообщенияИнтеграции.Направление
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСообщения
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	СтатусОбработки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(рдв_СообщенияИнтеграции.ВидСообщения, ""Не классифицируемые"") КАК ВидСообщения,
	|	КОЛИЧЕСТВО(1) КАК Количество,
	|	рдв_СообщенияИнтеграции.ИдентификаторСообщения
	|ИЗ
	|	РегистрСведений.рдв_ОшибкиИнтеграции КАК ОшибкиИнтеграции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.рдв_СообщенияИнтеграции КАК рдв_СообщенияИнтеграции
	|		ПО рдв_СообщенияИнтеграции.ИдентификаторСообщения = ОшибкиИнтеграции.ИдентификаторСообщения
	|ГДЕ
	|	ОшибкиИнтеграции.ДатаОшибки >= &Дата
	|СГРУППИРОВАТЬ ПО
	|	рдв_СообщенияИнтеграции.ВидСообщения,
	|	рдв_СообщенияИнтеграции.ИдентификаторСообщения
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСообщения
	|ИТОГИ
	|	СУММА(Количество)
	|ПО
	|	ВидСообщения";
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаМс = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Запрос.УстановитьПараметр("Дата", ТекущаяДата-(ПериодОбновления * 60));
	Запрос.УстановитьПараметр("ДатаМс", ТекущаяДатаМс-(ПериодОбновления * 60 * 1000));
	Запрос.УстановитьПараметр("ЭтотУзел", Справочники.рдв_ВнешниеСистемы.ЭтотУзел());
	
	Пакет = Запрос.ВыполнитьПакет();
	ВнешниеСистемы = Пакет[0].Выгрузить();
	АктуализироватьСостояниеВнешнихСистем(ВнешниеСистемы);
	
	ПолучениеОбработано = Пакет[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОтправкаИсходящаяОчередь = Пакет[2].Выгрузить();
	ОтправкаОтправлено = Пакет[3].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	Ошибки = Пакет[4].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Результат = Новый Структура;
	Результат.Вставить("ВнешниеСистемы", ВнешниеСистемы);
	Результат.Вставить("Отправка", Новый Структура("Регистрация,ПоСтатусам", ОтправкаИсходящаяОчередь, ОтправкаОтправлено));
	Результат.Вставить("Получение", Новый Структура("ПоСтатусам", ПолучениеОбработано));
	Результат.Вставить("Ошибки", Ошибки);
	
	Возврат Результат;
	
КонецФункции

#Область ВнешниеСистемы

Процедура АктуализироватьСостояниеВнешнихСистем(ВнешниеСистемы)
	
	Для Каждого ВнешняяСистема Из ВнешниеСистемы Цикл
		
		Состояние = ВнешниеСистемыСостояние(ВнешняяСистема.ВнешняяСистема);
		ВнешняяСистема.Состояние = ?(Состояние=Истина, 0, 2);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ВнешниеСистемыСостояние(ВнешняяСистема)
	
	Попытка
		Возврат рдв_Интеграция.ИнтеграцияВнешняяСистемаДоступна(ВнешняяСистема);
	Исключение
		Возврат Ложь;
	КонецПопытки; 
	
КонецФункции

#КонецОбласти

#КонецЕсли
